app/controllers/api/activities_controller.rb

    def index
      @activities = Activity.where(event_id: params[:event_id])
---
SELECT "activities".* FROM "activities" WHERE "activities"."event_id" = ?  [["event_id", 1]]

    def index_all
      @activities = Activity.all
---
SELECT "activities".* FROM "activities"

    def show
      @activity = Activity.find(params[:id])
      @teachers = Teacher.where(activity_id: params[:id]);
---
SELECT  "activities".* FROM "activities" WHERE "activities"."id" = ? LIMIT 1  [["id", 1]]
SELECT "teachers".* FROM "teachers" WHERE "teachers"."activity_id" = ?  [["activity_id", 1]]

    def schedule
      @event = Event.find(params[:event_id])
      activities_list = Activity.where(event_id: params[:event_id]).order(:start_time, :classroom_id).to_a
      @teachers = Teacher.all
      @start_times = []
      @activities =  []

      for i in 0 .. ((@event.end_date - @event.start_date)/86400).round
        @activities[i] = Hash.new
        classrooms = Activity.where('start_time >= :start AND start_time <= :end', {start: @event.start_date + i.day, end: (@event.start_date + (1+i).day)}).distinct.pluck(:classroom_id)
        classroom_current_activities = Hash[*classrooms.map { |k| [k,nil]}.flatten]
---
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
SELECT "activities".* FROM "activities" WHERE "activities"."event_id" = ?  ORDER BY "activities"."start_time" ASC, "activities"."classroom_id" ASC  [["event_id", 1]]
SELECT DISTINCT "activities"."classroom_id" FROM "activities" WHERE (start_time >= '2015-11-18 22:23:51.982757' AND start_time <= '2015-11-19 22:23:51.982757')
SELECT  "activities".* FROM "activities" WHERE (start_time >= '2015-11-18 22:23:51.982757' AND start_time <= '2015-11-19 22:23:51.982757')  ORDER BY "activities"."start_time" DESC LIMIT 1