app/controllers/api/pages_controller.rb

    def show
      @page = Page.find_by(stub: params[:stub], event_id: params[:event_id])
---
SELECT  "pages".* FROM "pages" WHERE "pages"."stub" = ? AND "pages"."event_id" = ? LIMIT 1  [["stub", "directions"], ["event_id", 15]]