app/controllers/api/pages_controller.rb

    def show
      @page = Page.find_by(slug: params[:slug], event_id: params[:event_id])
---
SELECT  "pages".* FROM "pages" WHERE "pages"."slug" = ? AND "pages"."event_id" = ? LIMIT 1  [["slug", "directions"], ["event_id", 1]]