app/controllers/api/staff_controller.rb

SELECT "staff_members".* FROM "staff_members" WHERE "staff_members"."event_id" = ?  [["event_id", 1]]
---
    def index
      @staff = StaffMember.where(event_id: params[:event_id])