app/controllers/api/teachers_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
SELECT DISTINCT "users".* FROM "users" INNER JOIN "teachers" ON "teachers"."user_id" = "users"."id" INNER JOIN "activities" ON "activities"."id" = "teachers"."activity_id" WHERE "activities"."event_id" = ?  ORDER BY "users"."sca_first_name" ASC, "users"."sca_last_name" ASC  [["event_id", 1]]
---
    def index
      @event = Event.find(params[:event_id])
      @users = User.joins(:activities).where(activities: { event_id: params[:event_id] }).distinct.order(:sca_first_name, :sca_last_name)

SELECT DISTINCT "users".* FROM "users" INNER JOIN "teachers" ON "teachers"."user_id" = "users"."id"
---
    def index_all
      @users = User.joins(:teachers).distinct

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "example"]]
---
    def show
      @user = User.find_by(username: params[:username])