app/views/api/teachers/index.json.jbuilder

SELECT "activities".* FROM "activities" INNER JOIN "teachers" ON "activities"."id" = "teachers"."activity_id" WHERE "teachers"."user_id" = ? AND "activities"."event_id" = ?  [["user_id", 1], ["event_id", 1]]
---
  json.activities do
    json.array! (user.activities.where(event_id: @event.id)) do |activity|