app/views/api/teachers/show.json.jbuilder

json.activities do
  json.array! (@user.activities.where('classroom_id IS NOT NULL')) do |activity|
---
SELECT "activities".* FROM "activities" INNER JOIN "teachers" ON "activities"."id" = "teachers"."activity_id" WHERE "teachers"."user_id" = ?  [["user_id", 1]]